Repository: 84000/data-translation-memory
Catalog: toh136-v3.tmx
Source language: bo
Languages: en

source: འཕགས་པ་ཁྱེའུ་བཞིའི་ཏིང་ངེ་འཛིན་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ། བམ་པོ་དང་པོ།
en: The Noble Mahāyāna Sūtra The Four Boys’ Absorption

source: སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ། །
en: Homage to all buddhas and bodhisattvas.

source: འདི་སྐད་བདག་གིས་ཐོས་པ་དུས་གཅིག་ན།
en: Thus did I hear at one time.

source: བཅོམ་ལྡན་འདས་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བ་དེ་ཉིད་ཀྱི་དུས་ཀྱི་ཚེ་ཀུ་ཤའི་གྲོང་ཁྱེར་ན་གྱད་རྣམས་དང་ཉེ་བ་ན་ཡོད་པ་ཤིང་སཱ་ལ་ཟུང་གི་ཚལ་ན་ཤིང་སཱ་ལ་ཟུང་གི་བར་ན་བཞུགས་སོ། །
en: At the time of his parinirvāṇa, the Blessed One was resting between a pair of śāla trees in the Yamakaśāla Grove near Kuśinagara, in the country of the Mallas. At this time, Venerable Ānanda went to see the Blessed One.

source: དེ་ནས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་ཐལ་མོ་སྦྱར་ཏེ་བཅོམ་ལྡན་འདས་ལ་མིག་མི་འཛུམས་པར་རྟོག་ཅིང་འདུག་གོ། །
en: When he came into his presence, he joined his palms together and then stood there looking at the Blessed One with his eyes wide open.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་བཀའ་སྩལ་པ། གོའུ་ཏ་མའི་བུ་ཁྱོད་ཅིའི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་ལ་མིག་མི་འཛུམས་པར་རྟོག་པར་བྱེད།
en: The Blessed One asked Venerable Ānanda, “Son of Gautama, why are you looking at the Thus-Gone One with your eyes wide open?”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་མདང་བདག་གིས་དེ་བཞིན་གཤེགས་པ་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བའི་སྔ་ལྟས་གཡར་ལམ་འཇིགས་པ་ཆེན་པོ་འཇིགས་སུ་རུང་བ་སྤུ་ཟིང་ཞེས་བགྱིད་པ་ཞིག་རྨིས་ལགས་ཏེ།
en: Venerable Ānanda replied, “Blessed One, I had a terrifying dream last night, a premonition of the Thus-Gone One’s parinirvāṇa, so terrifying that it made the hairs of my body stand on end.

source: བཅོམ་ལྡན་འདས་བདག་གཡར་ལམ་དེ་རྨིས་ནས་བཅོམ་ལྡན་འདས་ཤིན་ཏུ་མྱུར་བར་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་མི་འགྱུར་ལགས་གྲང་སྙམ་ནས་དེའི་སླད་དུ་སྡུག་བསྔལ་ཞིང་ཡིད་མི་བདེ་བ་དང་། མྱ་ངན་གྱི་ཟུག་རྔུས་གཟིར་བར་གྱུར་ལགས་སོ། །
en: Blessed One, ever since this dream I have been worried that the Blessed One may soon pass into parinirvāṇa, and because of this I have been miserable, unhappy, and pained by sorrow.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། གོའུ་ཏ་མའི་བུ་ཁྱོད་ཀྱི་རྨི་ལམ་ན་དེ་བཞིན་གཤེགས་པ་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བའི་སྔ་ལྟས་འཇིགས་པ་ཇི་ལྟ་བུ་ཞིག་རྨིས།
en: The Blessed One said, “Son of Gautama, what was this terrifying dream of yours, portending the Thus-Gone One’s parinirvāṇa?”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེའི་ཚེ་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་ཚིགས་སུ་བཅད་དེ་བཀའ་སྩལ་པ། སཱ་ལའི་ཚལ་ཁྲོད་འདི་ཉིད་དུ། །འཇིག་རྟེན་མགོན་པོའི་ལྟས་སུ་ནི། །ཁྱོད་ཀྱིས་རྨི་ལམ་ཅི་རྨིས་པ། །དྲིས་པ་དེ་ནི་ང་ལ་སྨྲོས། །
en: The Blessed One also asked this to Venerable Ānanda in verse: “Answer this question, Here in this grove of śāla trees: What was this dream of yours, With its premonition about the world protector?”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་ཚིགས་སུ་བཅད་དེ་གསོལ་པ། མདང་སུམ་བདག་གི་གཡར་ལམ་ན། །འཇིགས་སུ་རུང་ཞིང་དངངས་བགྱིད་ལ། །སྤུ་ཟིང་བགྱིད་པ་རྨིས་གྱུར་པ། །
en: Venerable Ānanda replied to the Blessed One in verse: “This was my dream last night— It was terrifying, it scared me, It made my hairs stand on end.

source: དེ་ནི་མི་མཆོག་གསན་དུ་གསོལ། །
en: Best of men, please listen.

source: འཇིག་རྟེན་ཁམས་འདིར་ལྗོན་པའི་ཤིང་། །རྟག་ཏུ་མེ་ཏོག་འབྲས་བུ་དག །རྣམ་པ་ཀུན་གྱི་མཆོག་ལྡན་པ། །ཡིད་ནི་དགའ་བར་བགྱིད་པ་འཁྲུངས། །འཇིག་རྟེན་ཁམས་སུ་ལྗོན་མཆོག་དེ། །གྲིབ་མ་བསིལ་བས་སེམས་ཅན་རྣམས། །རབ་ཏུ་དགའ་བགྱིད་བྲོ་ནད་དང་། །མྱ་ངན་དག་ཀྱང་སེལ་བར་བགྱིད། །
en: “In this world grew a tree Constantly bearing flowers and fruit, A tree to gladden the heart, Replete with all excellent qualities, “An excellent tree Casting its cooling shade on the world, Delighting beings, Dispelling their illnesses and sorrows.

source: ཡོན་ཏན་མཐའ་ཡས་ཕུན་ཚོགས་ཤིང་། །སྲིད་རྩེའི་བར་དུ་མཐོ་བར་འཕགས། །དེ་མཐོང་བས་ནི་མིག་དག་ཅིང་། །ཐོས་པས་རྣ་བ་རྣམ་དག་འགྱུར། །
en: “Wondrous, infinite in qualities, Reaching as high as the summit of existence— To behold it purifies the eye; To hear of it purifies the ear.

source: དེ་ལས་རབ་འཇམ་དོན་ལྡན་ཞིང་། །ཤིན་ཏུ་རིགས་ཤིང་ཆོས་ལྡན་ལ། །སེམས་ཅན་ཀུན་ལ་བདེ་སྐྱིད་པའི། །སྒྲ་སྐད་དག་ཀྱང་ངེས་པར་འབྱུང་། །
en: “From it came a voice, pure and sure, Delighting all beings, Soft and meaningful, Noble and virtuous.

source: དེ་ལས་གང་གཱའི་བྱེ་སྙེད་ཀྱི། །འོད་ཟེར་དག་ནི་འབྱུང་འགྱུར་ཞིང་། །
en: “From it shone rays of light As numerous as the sands of the river Gaṅgā.

source: དེ་དག་སྙེད་ཀྱི་ཞིང་རྣམས་ཀྱང་། །ལྗོན་ཤིང་ཆེན་པོས་བསལ་བར་བགྱིད། །
en: So that as many realms Were illuminated by this great tree.

source: ཕྱོགས་བཅུའི་འཇིག་རྟེན་ཁམས་ཀྱི་མི། །མཐའ་ཡས་དཔག་ཏུ་མ་མཆིས་པ། །གང་དག་འོད་ཀྱིས་རེག་གྱུར་པ། །སེམས་ཅན་རྣམས་ཀྱི་དོན་ཀྱང་བགྱིད། །
en: “Those humans in the worlds of the ten directions, Endless, boundless in number, Who were touched by this light Benefited beings.

source: ཕྱོགས་བཅུའི་འཇིག་རྟེན་ཁམས་སུ་ནི། །དེ་ལས་དྲི་ངད་འབྱུང་བར་འགྱུར། །གང་དག་དེ་ཡི་དྲི་སྣོམ་པ། །དེ་དག་ངན་འགྲོར་མཆི་མི་འགྱུར། །
en: “Scent from this tree Spread throughout the worlds of the ten directions, And those who sensed it Were not reborn in lower realms.

source: དེ་དག་དམྱལ་བར་མི་མཆི་ཞིང་། །དུད་འགྲོའི་སྐྱེ་གནས་སྡིག་ཅན་དང་། །ཡི་དགས་ལྷ་མིན་རིས་མི་མཆི། །
en: “They were not reborn in the hells, Nor as brutish animals, Nor among pretas and asuras.

source: དེ་དག་བཟང་འགྲོར་མཆི་བར་འགྱུར། །
en: They had only favorable rebirths.

source: སེམས་ཅན་ཀུན་ལ་བདེ་སྐྱེད་པ། །དེ་འདྲའི་ལྗོན་ཤིང་ཆེན་པོ་དེ། །གྱད་ཀྱི་དོག་སར་ཆག་ནས་ནི། །སཱ་ལའི་ཚལ་གྱི་གསེབ་ཏུ་སྒྱེལ། །
en: “Then this great tree That brought delight to all beings Broke in pieces in the Malla country And fell amidst a grove of śāla trees.

source: ལྗོན་མཆོག་ཆག་པ་མཐོང་གྱུར་ནས། །དེ་ནས་སྲོག་ཆགས་སྟོང་ཕྲག་ནི། །བསམ་ཡས་དཔག་ཏུ་མ་མཆིས་པ། །ཆོ་ངེས་འདེབས་ཤིང་སྨྲེ་སྔགས་འདོན། །
en: “When they saw the great tree break, Thousands of creatures, Unimaginable, limitless in number, Wept and lamented.

source: དེ་ཚེ་སྒྲ་དེ་མི་གྲག་ཅིང་། །དྲི་ཡང་བདའ་བར་མ་གྱུར་པ། །གདེག་པའི་རྔོ་ཡང་མ་ཐོགས་ནས། །
en: “No longer would its sound be heard; Its scent had stopped spreading.

source: དེ་མ་ཐག་ཏུ་བདག་ཀྱང་བརྒྱ་ལ། །
en: Without any warning of illness, I, too, immediately collapsed.

source: དེ་ལྟར་འཇིགས་སུ་རུང་བ་དང་། །སྤུ་ཡང་ཟིང་ཞེས་བགྱིད་པ་ཡི། །གཡར་ལམ་མདང་སུམ་རྨིས་པ་དེ། །སྤྱན་དང་ལྡན་པ་བདག་ལ་གསུངས། །
en: “Seer, please explain to me This dream I had last night, So terrifying That it made my hairs stand on end.”

source: དེ་ནས་གནས་གཙང་མའི་རིས་ཀྱི་ལྷའི་བུ་རྣམས་དང་། མི་མཇེད་ཀྱི་བདག་པོ་ཚངས་པ་དང་། བདུད་ཀྱི་བུ་དེད་དཔོན་དང་། ལྷའི་དབང་པོ་བརྒྱ་བྱིན་དང་།
en: At that moment, the gods of the pure abodes; Brahmā, lord of the Sahā world; Māra’s son Sārthavāha; Śakra, lord of the gods; and the Four Great Kings all saw, in their respective realms, signs portending the parinirvāṇa of the Blessed One.

source: རྒྱལ་པོ་ཆེན་པོ་བཞི་པོ་དག་སོ་སོ་ན་གནས་པས་བཅོམ་ལྡན་འདས་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བའི་སྔ་ལྟས་མཐོང་ནས་རང་རང་གི་འཁོར་ལྷའི་བུ་ཁྲག་ཁྲིག་ཕྲག་བརྒྱད་ཅུ་བརྒྱད་ཅུ་ལྷག་ཙམ་གྱིས་ཡོངས་སུ་བསྐོར་ཅིང་མདུན་དུ་བདར་ནས་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་དོང་སྟེ་ལྷགས་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ།
en: Each escorted by retinues of more than eighty billion gods, they went to where the Blessed One was.

source: སྒྲ་སྐད་འཐུན་པར་ཉམ་ཐག་པའི་ང་རོས་ངུ་ཞིང་མྱ་ངན་བྱེད་ལ་སྨྲེ་སྔགས་འདོན་བཞིན་དུ་དེའི་ཚེ་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་ཚིགས་སུ་བཅད་པ་འདི་དག་སྨྲས་སོ། །
en: When they arrived, they bowed their heads to the feet of the Blessed One, and in unison they cried out in despair—moaning, sobbing, and lamenting—and spoke these verses to Venerable Ānanda: “Ah!

source: ཀྱེ་མའོ་སྡུག་བསྔལ་མི་བཟད་ཆེ། །
en: What intense, unbearable suffering!

source: སཱ་ལའི་ཚལ་ཁྲོད་དགའ་བར་ནི། །དེ་རིང་མགོན་པོ་མྱ་ངན་འདའ། །
en: In this delightful grove of śāla trees, on this very day, Our protector will pass into nirvāṇa.

source: ཀུན་དགའ་ཁྱོད་ཀྱིས་མི་ཤེས་སམ། །གང་ཞིག་སྣང་མེད་རྣམས་ཀྱི་སྒྲོན། །སྐྱབས་དང་དཔུང་གཉེན་གང་ཡིན་པ། །དེ་ནི་ཞི་བ་ལེན་མེད་པར། །དེ་རིང་མྱ་ངན་འདའ་བར་འགྱུར། །
en: Ānanda, do you not know— “The lamp for those who live in the dark, Our refuge and our last resort, Without grasping at peace, Will pass into nirvāṇa today.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེའི་ཚེ་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་དང་ཐམས་ཅད་དང་ལྡན་པའི་ལྷའི་འཁོར་དེ་དག་ལ་ཚིགས་སུ་བཅད་དེ་བཀའ་སྩལ་པ། ཇི་ལྟར་མཐོང་བ་གཞན་མིན་ཏེ། །དེ་རིང་སཱ་ལའི་ཚལ་ཁྲོད་དུ། །ང་ནི་མྱ་ངན་འདའ་འགྱུར་གྱིས། །
en: The Blessed One then spoke these verses to Venerable Ānanda and all the assembled gods: “It is just as you have seen: Today, in this grove of śāla trees, I shall pass into nirvāṇa.

source: མྱ་ངན་མ་བྱེད་བརྟན་པར་གྱིས། །
en: Do not suffer. Be steady.

source: ཁ་དོག་ལྡན་ཞིང་བསམ་ཡས་ལ། །འོད་དང་དྲི་བསུང་ཕུན་ཚོགས་པའི། །ལྗོན་ཤིང་ལྗོན་པ་ཆེན་པོ་དེ། །སཱ་ལའི་ཚལ་ཁྲོད་ཆག་གྱུར་པ། །
en: “That marvelous, mighty tree, Once lustrous beyond imagination, Radiant and fragrant, Has broken amidst this grove of śāla trees.

source: ལྗོན་ཤིང་ཅི་འདྲར་སྟོན་པ་ནི། །དེ་རིང་སཱ་ལའི་ཚལ་ཁྲོད་དུ། །ཇི་ལྟར་མེ་ལ་ཆུས་བཏབ་བཞིན། །ལེན་མེད་མྱ་ངན་འདའ་བར་འགྱུར། །
en: “The teacher, like that tree, Will today, in this grove of śāla trees, Pass without grasping into nirvāṇa, Like fire extinguished by water.

source: ཤེས་རབ་རྫུ་འཕྲུལ་མཐར་ཕྱིན་པ། །ཉེ་རྒྱལ་པང་ནས་སྐྱེས་དག་བཞིན། །མི་མཆོག་ང་ཡང་འདའ་འགྱུར་བར། །
en: “Upatiṣya and Kolita, Perfect in knowledge and in miraculous power— These great men will also pass beyond.

source: ཀུན་དགའ་ཁྱོད་ཀྱིས་མི་ཤེས་སམ། །འདུས་བྱས་ཐམས་ཅད་མི་རྟག་སྟེ། །སྐྱེ་ཞིང་འཇིག་པའི་ཆོས་ཅན་ཡིན། །
en: Ānanda, do you not know— “All composite things are impermanent; By nature they form and disintegrate.

source: སྟོན་པས་དེ་དག་རབ་མཁྱེན་ནས། །དགེ་སློང་རྣམས་ལ་དེ་ཡང་བཤད། །
en: The teacher has thoroughly understood this And explained it to his monks.

source: ཀུན་དགའ་ཚུར་ཤོག་ཁྱོད་སོང་ལ། །ང་ཡི་ཉན་ཐོས་རྣམས་ལ་སྨྲོས། །ལྷ་ཡི་མིག་གི་མཐར་ཕྱིན་པ། །གནས་བརྟན་ཆེན་པོ་མ་འགགས་དང་། །གནས་བརྟན་ཆེན་པོ་ཀ་ཏྱའི་བུ། །གནས་བརྟན་གང་པོ་རབ་འབྱོར་དང་། །གསུས་པོ་ཆེ་ནི་ཆེན་པོ་དང་། །བ་ལང་བདག་དང་དགའ་བྱེད་དང་། །
en: “Ānanda, come closer!

source: གྲོ་ཞིན་དོན་ཡོད་རྒྱལ་པོ་དང་། །ཆོས་གོས་ངན་པ་འཆང་བ་དང་། །དགའ་བོ་དང་ནི་སྒྲ་གཅན་བཟང་། །ང་ཡི་ཉན་ཐོས་གཞན་རྣམས་དང་། །སློབ་དང་མི་སློབ་གནས་བརྟན་དང་། །
en: Go and tell my disciples— The great elder Aniruddha, Who has perfected divine sight, “The great elder Kātyāyana, The great elders Pūrṇa and Subhūti, The great Kauṣṭhila, Gavāmpati, Nandika, “Śroṇa, and Amogharāja, Wearer of tattered robes, Nanda and Rāhula, And my other disciples, “The elders still in training, those beyond training, And all other ordinary people— That I shall pass into nirvāṇa.

source: གཞན་ཡང་སོ་སོའི་སྐྱེ་བོ་དག །ང་ནི་མྱ་ངན་འདའ་འགྱུར་གྱིས། །ཐམས་ཅད་ཤིན་ཏུ་མྱུར་བར་སྦྲོན། །
en: Quickly, call everyone!

source: སློབ་དང་སོ་སོའི་སྐྱེ་བོ་ཡིས། །མ་མཐོང་སྡུག་བསྔལ་སྐྱེ་འགྱུར་བས། །མྱ་ངན་འདས་པའི་འོག་ཏུ་ནི། །མྱ་ངན་ཟུག་རྔུས་གཟིར་མི་བྱ། །
en: “Those in training and ordinary people Who are upset by what has not been experienced before Should not be pierced with pain and suffering After I have passed into nirvāṇa.

source: མྱ་ངན་མ་བྱེད་འདུ་བྱེད་རྣམས། །
en: “Do not grieve.

source: མི་རྟག་རྨི་ལམ་ལྟ་བུ་ཞེས། །
en: Composite things Are impermanent and dream-like.

source: ཇི་ལྟར་ཆོས་ཀྱི་ཆོས་ཉིད་ཀྱིས། །དེ་དག་རྣམས་ནི་དབུགས་དབྱུང་བྱ། །
en: This true nature of phenomena Should bring them relief.”

source: དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་། བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་སླར་ཚིགས་སུ་བཅད་དེ་གསོལ་པ།
en: Thus he spoke, and Venerable Ānanda again addressed the Blessed One in verse: “Protector!

source: མགོན་པོ་སངས་རྒྱས་མྱ་ངན་ལས། །
en: Awakened One!

source: འདའ་བར་འགྱུར་བར་ཐོས་ནས་བདག །ཕྱོགས་སླད་བདག་ནི་ལུས་རྨ་ཞིང་། །
en: When I heard you will pass into nirvāṇa, I fainted and hurt myself.

source: བདག་ནི་གཡར་ངན་ཤིན་ཏུ་ཆེ། །ལུས་ཉམས་བདེ་བ་མ་མཆིས་ཤིང་། །སེམས་ཉམས་བདེ་བའང་མ་མཆིས་ལ། །ཆགས་བྲལ་ཉམས་བདེའང་མ་མཆིས་ན། །
en: I am utterly crestfallen— “Both my body and mind are distressed, My mind is not composed, I am unsettled by attachment.

source: སྤྱན་ལྡན་བདག་ནི་ཇི་ལྟར་མཆི། །
en: Seer, what will become of me?

source: བདག་གི་སྐྱབས་དང་དཔུང་གཉེན་དང་། །
en: “You are my refuge and last resort.

source: འཇིག་རྟེན་རྣམ་འདྲེན་གང་ལགས་པ། །
en: You are the guide for this world.

source: དེང་མཐོང་སླད་ཀྱིས་མི་མཐོང་ཞེས། །གནས་བརྟན་རྣམས་ལ་ཇི་སྐད་བགྱི། །
en: How can I tell the elders That today you are here but soon will be gone?

source: མྱ་ངན་གྱུར་ཅིང་སྡུག་བསྔལ་བས། །ཇི་ལྟར་མྱ་ངན་བརྗོད་པར་བགྱི། །
en: “How can such sorrow be told By one bearing such sorrow and pain?

source: བདག་ཅག་རྣམས་ཀྱི་འཇིགས་ཆེན་འདི། །གནས་བརྟན་དེ་དག་ཇི་ལྟར་ཉན། །
en: How can the elders listen to this, Our great fear?

source: གང་དག་སློབ་དང་སྐྱེ་བོ་ཡི། །དགེ་སློང་མྱ་ངན་ཟུག་རྔུ་ཡིས། །ཀུན་ནས་ཟུག་པ་ཇི་ལྟར་གནས། །
en: “When those in training and ordinary monks Are pierced by grief, completely run through, How can they survive?

source: མི་མཆོག་བསྐལ་པར་བཞུགས་སུ་གསོལ། །
en: Best of men, please stay for an eon!

source: འཁོར་བཞིའི་ནང་དུ་མཆིས་ནས་ནི། །སྟོན་པ་མྱ་ངན་འདའ་འགྱུར་ཞེས། །ཇི་ལྟར་བརྗོད་བགྱི་མི་ཡི་མཆོག །
en: “How can I go, best of men, Among the four communities And announce that the teacher will pass away?

source: ཐུབ་ཆེན་བསྐལ་པར་བཞུགས་སུ་གསོལ། །
en: Great sage, please remain for an eon!

source: སྒྲོན་མ་ཆེན་པོའི་འཇིག་རྟེན་དུ། །ཤིན་ཏུ་མྱུར་བར་ནུབ་འགྱུར་ཏེ། །འཇིག་རྟེན་འདི་དག་རབ་མྱུར་བར། །ལྡོངས་པ་ཉིད་དུ་འགྱུར་ལགས་སོ། །
en: “The great lamp of this world Is quickly fading, And all the worlds will soon Fall into darkness.

source: མི་མཆོག་བདག་ནི་གཡར་ངན་འདི། །དགེ་སློང་རྣམས་ལ་སྨྲར་མི་སྤྲོ། །
en: “Best of men, please, do not send me, So crestfallen, to speak to the monks!

source: གང་ལ་གཡར་ངན་མ་མཆིས་པ། །གཞན་ཞིག་མངག་པར་བཀའ་སྩལ་གསོལ། །
en: I beg you, entrust this to someone else Who is not so crestfallen!”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། གོའུ་ཏ་མའི་བུ་འདུ་བྱེད་ཐམས་ཅད་མི་རྟག་པ་ཡིན་གྱིས་མྱ་ངན་མ་བྱེད་པར་ཐོང་ཅིག །
en: The Blessed One replied, “Son of Gautama, all composite things are impermanent, so do not be upset, let them go!”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེའི་ཚེ་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་ཕྱིར་ཚིགས་སུ་བཅད་དེ་བཀའ་སྩལ་པ། །བྱེ་བ་མཐའ་ཡས་ལྷ་རྣམས་ཀྱིས། །དེ་རིང་སངས་རྒྱས་འདའ་ཐོས་ནས། །གཞལ་མེད་ཁང་དག་སྤངས་ནས་ནི། །མྱ་ངན་བྱེད་ཅིང་སྨྲེ་སྔགས་འདོན། །
en: The Blessed One then spoke these verses for the sake of Venerable Ānanda: “Hearing that the Buddha will pass away today, Millions upon millions of gods Have left their palaces, Grieving and lamenting.

source: ང་འདས་ཕྱི་ན་དགེ་སློང་དག །མ་མཐོང་མྱ་ངན་བྱེད་མ་གཞུག །འདི་ནི་རིམ་གྲོ་བྱེད་པའི་ལས། །
en: “After I have passed, Do not let monks be upset at not having seen me— This is the service I request.

source: སོང་ལ་དགེ་སློང་རྣམས་ཀྱང་སྦྲོན། །
en: Go, and summon all the monks!”

source: དེའི་ཚེ་ཚེ་དང་ལྡན་པ་མ་འགགས་པ་རི་རབ་ཀྱི་སྤོ་ལ་སུམ་ཅུ་རྩ་གསུམ་པའི་ལྷ་རྣམས་ལ་ཆོས་སྟོན་ཅིང་འདུག་གོ། །
en: At that time, Venerable Aniruddha was at the summit of Sumeru teaching the Dharma to the gods of the Heaven of the Thirty-Three.

source: ཚེ་དང་ལྡན་པ་མ་འགགས་པས་ལྷའི་མིག་རྣམ་པར་དག་པ་མི་ལས་ཤིན་ཏུ་འདས་པས་ལྷའི་བུ་དབང་ཆེ་བ་དབང་ཆེ་བར་གྲགས་པ་རྣམས་རང་རང་གི་གཞལ་མེད་ཁང་དག་ནས་མི་སྣང་བར་གྱུར་པ་མཐོང་ཞིང་ལྷ་རྣམས་ཀྱི་སྨྲེ་སྔགས་འདོན་པའི་སྒྲ་ཆེན་པོ་དག་ཀྱང་ཐོས་རང་གི་འཁོར་རྣམས་ཀྱང་སྲབས་པར་མཐོང་ངོ་། །
en: Venerable Aniruddha, who possessed pure divine sight that far surpassed that of a human, could see that the gods, renowned as the mightiest of the mighty, were disappearing from their palaces. He could hear, too, the gods’ powerful cries of lament, and he watched as his own audience thinned.

source: དེ་ནས་ཚེ་དང་ལྡན་པ་མ་འགགས་པས་དེའི་ཚེ་བསམས་ཏེ་ལྷའི་མིག་གིས་ལྷའི་བུ་འཁོར་དང་བཅས་པ་དེ་དག་ཡི་ཆད་ཅིང་རང་རང་གི་འདོད་པའི་དགའ་བ་དག་སྤངས་ཏེ་རིངས་པ་རིངས་པར་གང་དུ་དོང་ཞིང་འདོང་བར་བྱེད་ཅེས་འཇིག་རྟེན་ལ་རྣམ་པར་བལྟས་སོ། །
en: Venerable Aniruddha focused his mind, and with his divine sight he looked closely at the world. The gods and their entourages were in a state of anxiety, giving up on their sense pleasures and departing somewhere in great haste.

source: དེ་ནས་ཚེ་དང་ལྡན་པ་མ་འགགས་པས་རིའི་རྒྱལ་པོ་རི་རབ་ཀྱི་རྩེ་མོ་ལས་དཔག་ཚད་བརྒྱ་ཙམ་དག་ཆད་པ་དང་། རིའི་རྒྱལ་པོ་རི་རབ་ཀྱི་རྩེ་མོ་ལས་དཔག་ཚད་ཉིས་བརྒྱ་ཙམ་དང་། རྩེ་མོ་ལས་དཔག་ཚད་སུམ་བརྒྱ་ཙམ་དང་། རྩེ་མོ་ལས་དཔག་ཚད་བཞི་བརྒྱ་ཙམ་དག་ཆད་པ་དང་། རྩེ་མོ་ལས་དཔག་ཚད་ལྔ་བརྒྱ་ཙམ་དག་ཆད་ཅིང་ཆད་ཅིང་རྒྱ་མཚོ་ཆེན་པོའི་ནང་དུ་ལྷུང་བ་དག་ཀྱང་མཐོང་སྟེ་སེམས་ཅན་འགའ་ཙམ་ལ་ཡང་གནོད་པའམ། རྣམ་པར་འཚེ་བར་མི་བྱེད་ན་སྲོག་གི་བར་ཆད་བྱེད་པར་འགྱུར་བ་ལྟ་སྨོས་ཀྱང་ཅི་དགོས།
en: Venerable Aniruddha saw those who had reached farther and farther away from the summit of the king of mountains—some who were one hundred leagues distant, some two hundred leagues, some three hundred leagues, some four hundred leagues, and some five hundred leagues away—and some who had fallen into the ocean, though such beings could not be harmed nor injured, let alone killed.

source: འདི་ལྟར་རི་རབ་ཀྱི་རྩེ་མོ་དེ་དག་ཀྱང་གང་དག་རིའི་རྒྱལ་པོ་རི་རབ་ལ་རྟེན་ཅིང་གནས་པའི་ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དེ་དག་གིས་བཅོམ་ལྡན་འདས་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བ་ཐོས་ནས་མྱ་ངན་གྱི་ཟུག་རྔུས་གཟིར་ཅིང་བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པ།
en: Like those at the summit of Sumeru, all those beings living on Sumeru, the king of mountains—gods, nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, and mahoragas—were struck with grief when they heard of the Blessed One’s parinirvāṇa.

source: ཤཱཀྱའི་བདག་པོའི་རྒྱལ་པོ་བསྐལ་པ་བྱེ་བ་གྲངས་མེད་པ་ནས་ཡང་དག་པར་བསྒྲུབས་པ། དགེ་བའི་རྩ་བ་ཤིན་ཏུ་ཡོངས་སུ་དག་པ་དང་ལྡན་པ་དེ་དེ་རིང་གྱད་རྣམས་དང་ཉེ་བ་ན་ཡོད་པ་ཤིང་སཱ་ལ་ཟུང་གི་དྲུང་དུ་ལེན་པ་མེད་པར་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་འགྱུར་ཏེ།
en: “Blessed Śākyamuni,” they cried, “king among lords of the Śākyas, who reached perfection countless millions of eons ago, whose roots of virtue are utterly pure, will today, in the country of the Mallas, before a pair of śāla trees, pass without grasping, into parinirvāṇa.

source: དེང་ནི་ལྷ་དང་བཅས་པའི་འཇིག་རྟེན་གྱི་མིག་ཟུམ་པར་འགྱུར་རོ་ཞེས་དེ་དག་ཀུ་ཤའི་གྲོང་ཁྱེར་ལོགས་སུ་མངོན་པར་ཕྱོགས་ཏེ།
en: Today, the eye of this world with its gods, shall close!”

source: རིངས་པ་རིངས་པར་བརྟད་ཅིང་དོང་བ་དག་གིས་རིའི་རྒྱལ་པོ་རི་རབ་ཀྱི་རྩེ་མོ་དེ་དག་ཀུན་ཏུ་རབ་ཏུ་བསྒུལ་ཅིང་ཀུན་དུ་རབ་ཏུ་བསྐྱོད་དེ་རིངས་པ་རིངས་པར་བརྟད་པ་དེ་དག་གིས་རིའི་རྒྱལ་པོ་རི་རབ་དང་། རྒྱ་མཚོ་ཆེན་པོ་ཡང་གཡོས་ཤིང་འཁྲུགས་པར་གྱུར་ཏེ་དེའི་ཕྱིར་རིའི་རྒྱལ་པོ་རི་རབ་ཀྱི་རྩེ་མོ་དེ་དག་རྒྱ་མཚོ་ཆེན་པོའི་ནང་དུ་ལྷུང་བར་གྱུར་ཏོ། །
en: they cried, and they journeyed toward Kuśinagara, traveling with such haste that the peaks of Sumeru, the king of mountains, shook and trembled; traveling with such haste that Sumeru, the king of mountains, along with its oceans, quaked and roiled so violently that those at the summit of Sumeru, the king of mountains, fell into the ocean.

source: དེ་ནས་ཚེ་དང་ལྡན་པ་མ་འགགས་པ་རི་རབ་ཀྱི་སྤོ་ལ་འདུག་པས་དེའི་ཚེ་སྒྲ་སྐད་ཆེན་པོ་ཕྱུང་སྟེ་ཚིགས་སུ་བཅད་པ་འདི་དག་སྨྲས་སོ། །འཇིག་རྟེན་རྣམས་ཀྱི་དེད་དཔོན་གང་ཡིན་པ། །གང་གིས་འཇིག་རྟེན་བདེ་བ་སྩོལ་མཛད་ཅིང་། །སེམས་ཅན་རྣམས་ཀྱི་སྦྱིན་གནས་གང་ཡིན་པ། །ཐུབ་པ་དེ་ནི་དེ་རིང་མྱ་ངན་འདའ། །
en: Then Venerable Aniruddha, still seated at the summit of Sumeru, let out a great cry and spoke these verses: “The leader of worlds, Who bestows joy on those worlds, Who is worthy of beings’ offerings, The sage, will pass into nirvāṇa today.

source: ཡེ་ཤེས་འབྱུང་གནས་རབ་རིབ་མུན་བཅོམ་ཞིང་། །འཇིག་རྟེན་སྲོག་ཆགས་རྣམས་ཀྱི་ཕ་དང་མ། །དེ་བཞིན་སྐྱབས་དང་དཔུང་གཉེན་གང་ཡིན་པ། །ཐུབ་པ་དེ་ནི་དེ་རིང་མྱ་ངན་འདའ། །
en: “The source of wisdom, conqueror of darkness and gloom, Father and mother to all living creatures, Our refuge and our last resort, The sage, will pass into nirvāṇa today.

source: ཟུག་རྔུ་འབྱིན་མཛད་སྡིག་མེད་ཉོན་མོངས་མེད། །གསོ་མཛད་དམ་པ་སྨན་པ་ཆེན་པོ་སྟེ། །མི་དགེའི་ཟུག་རྔུ་འབྱིན་མཆོག་གང་ཡིན་པ། །ཐུབ་པ་དེ་ནི་དེ་རིང་མྱ་ངན་འདའ། །
en: “The remover of pain, free from wrongdoing and affliction, The sublime sustainer, the great physician Who removes the thorns of nonvirtuous behavior, The sage, will pass into nirvāṇa today.

source: གང་ཞིག་སེམས་ཅན་ཆགས་དང་སྡང་བས་བཅོམ། །རྨོངས་པས་ཟིལ་ནོན་རྒ་དང་འཆི་ལ་ཆགས། །འགགས་འགལ་ལམ་ལོག་ཞུགས་པ་གཟིགས་ནས་ནི། །འཇིག་རྟེན་ཐུགས་རྗེ་བསྐྱེད་ནས་ཆོས་སྟོན་ཅིང་། །གང་ཞིག་བདུད་སྡེ་རབ་གཏུམ་དྲག་པོའི་གཟུགས། །
en: “Seeing beings overpowered by attachment and aversion, Crushed by ignorance, caught up in old age and death, Stuck, and following mistaken paths, He developed compassion for the world and taught the Dharma.

source: སྣ་ཚོགས་གཟུགས་ཅན་མཚོན་སྲ་རྡོ་རྗེ་ཐོགས། །ཁ་ཅིག་འཇིགས་པ་དུ་མ་རྣམ་སྟོན་ཅིང་། །གཞན་དག་སྣ་ཚོགས་བྲག་ཐོགས་འཁོད་གྱུར་པ། །དེ་འདྲར་རྣམ་མང་དྲག་པོའི་གཟུགས་ཅན་གྱི། །སྡེ་དག་གཟིགས་ཀྱང་མི་གཡོ་མི་འགུལ་བ། །
en: “He to whom appeared the hordes of Māra, fierce in form, In various guises and brandishing adamantine weapons, Some flaunting many frightful features, Others wielding rocks and boulders— “Though beholding such diverse terrifying forms, He remained unmoved, unperturbed.

source: བདུད་ཀྱི་སྡེ་བཅོམ་འཇིག་རྟེན་མགོན་པོ་དེ། །སཱ་ལའི་ཚལ་དུ་དེ་རིང་མྱ་ངན་འདའ། །
en: The protector of the world, who defeated those hordes of Māra, Will pass today into nirvāṇa, in the grove of śāla trees.

source: གང་གིས་ཕྱག་གཡས་རབ་ཏུ་བརྐྱང་མཛད་དེ། །རི་རབ་རྩེ་འདི་གྲོང་བཅས་གཡོ་མཛད་ཅིང་། །ཆོས་ཀུན་མངའ་བརྙེས་རྣམ་འདྲེན་དྲང་སྲོང་དེ། །སཱ་ལའི་ཚལ་དུ་མྱ་ངན་འདའ་བར་འགྱུར། །
en: “He who by merely extending his right arm Can make this summit of Sumeru and its celestial cities tremble, The guide and seer who has mastered all phenomena, Will pass today into nirvāṇa, in the grove of śāla trees.

source: གང་གིས་བརྡབས་པ་ཕྱོགས་བཅུར་བསམ་ཡས་པའི། །སྒྲ་བསྒྲགས་མཁྱེན་པའི་ཕ་རོལ་བྱོན་གྱུར་པ། །སྟོན་པ་སེམས་ཅན་རྣམས་ཀྱི་སྙིང་པོ་དེ། །སཱ་ལའི་ཚལ་དུ་དེ་རིང་མྱ་ངན་འདའ། །
en: “He whose words resound boundlessly in the ten directions, Who has crossed to the far shore of knowledge, The teacher, the heart of every being, Will pass today into nirvāṇa, in the grove of śāla trees.

source: གང་གིས་སྟོབས་ལྡན་སྡེར་བཅས་སྐྲག་མཛད་ཅིང་། །མི་གཡོ་མྱ་ངན་མེད་པ་འདུས་མ་བྱས་པ་བརྙེས། །
en: “He who strikes fear in mighty hordes Has discovered the unshakeable, the absence of sorrow, the uncompounded.

source: སྲོག་ཆགས་རྣམས་ལ་ཕན་ཕྱིར་འཁོར་ལོ་བསྐོར་མཛད་ཅིང་། །ཐུབ་པས་བདེན་པ་བཞི་དག་རབ་ཏུ་བསྟན། །
en: The sage, setting the wheel in motion for the benefit of living beings, Clearly set forth the four truths.

source: གང་ཞིག་ཆོ་འཕྲུལ་བསམ་གྱིས་མི་ཁྱབ་སྟེ། །སྐྲ་རྩེའི་ཁྱོན་ལ་ཞིང་རྣམས་བཀོད་མཛད་ཅིང་། །སྐུ་ལ་སྐུ་ཡི་འདུ་ཤེས་མི་མངའ་བ། །མགོན་པོ་དེ་ནི་དེ་རིང་མྱ་ངན་འདའ། །
en: “He whose miraculous powers are inconceivable, Who can lay out many realms on the tip of a hair, Whose body is beyond any notion of physical form, The protector, will pass into nirvāṇa today.

source: སྟོན་པ་གྱད་ཀྱི་ཡུལ་དུ་གཤེགས་ནས་ནི། །
en: “The teacher has gone to the Malla kingdom.

source: ཉེ་ན་ཡོད་པའི་ཚལ་ཁྲོད་ཞུགས་གྱུར་ཏེ། །བསམ་གཏན་ཞི་ལ་བདག་ཉིད་མཉམ་བཞག་ནས། །
en: He has taken up residence in a nearby grove And immersed himself in the calm of concentration.

source: ཤིང་ཟད་མེ་ལྟར་མྱ་ངན་འདའ་བར་འགྱུར། །
en: He will pass into nirvāṇa, like a fire going out when the wood has been used up.”

source: ཚེ་དང་ལྡན་པ་མ་འགགས་པས་ཚིགས་སུ་བཅད་པ་དེ་དག་སྨྲས་མ་ཐག་ཏུ་དེ་ནས་དེའི་ཚེ་སངས་རྒྱས་ཀྱི་མཐུས་འཛམ་བུའི་གླིང་ན་དགེ་སློང་དང་། དགེ་སློང་མ་དང་། དགེ་བསྙེན་དང་། དགེ་བསྙེན་མ་ཇི་སྙེད་པ་རྣམས་ལས་གནས་བརྟན་འོད་སྲུང་ཆེན་པོ་འཁོར་དང་བཅས་པ་མ་གཏོགས་པ་དང་། གཞན་ཡང་དགེ་སློང་ཉིས་བརྒྱ་རྩ་བཞི་མ་གཏོགས་པ་དེ་ལས་གཞན་པའི་འཁོར་བཞི་པོ་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་ཕྱག་འཚལ་བ་རྣམས་བཅོམ་ལྡན་འདས་ལ་བལྟ་བའི་ཐ་མར་གྱུར་པ་ནི་འདི་ཡིན་ནོ་ཞེས་གྱད་རྣམས་ཀྱི་ཉེ་བ་ན་ཡོད་པ་ཤིང་སཱ་ལ་ཟུང་གི་ཚལ་ག་ལ་བ་དེར་དོང་ངོ་། །ཚེ་དང་ལྡན་པ་མ་འགགས་པས་ཚིགས་སུ་བཅད་པ་དེ་དག་སྨྲས་མ་ཐག་ཏུ་དེ་ནས་དེའི་ཚེ་གཞན་ཡང་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ན་མངོན་པར་ཤེས་པ་མངོན་པར་ཤེས་པའི་ལྷ་དང་། ལྷའི་བུ་མོ་དང་། ཀླུ་དང་།
en: At the very moment Venerable Aniruddha finished speaking these verses, through the Buddha’s power, all the monks and nuns and male and female lay devotees in the world, the four communities who revered the Blessed One—except for Mahākāśyapa and his entourage, and 224 monks—exclaimed, “This is our last chance to see the Blessed One!”

source: ཀླུ་རྒན་ཕོ་དང་། ཀླུའི་བུ་མོ་དང་། གནོད་སྦྱིན་དང་། གནོད་སྦྱིན་གཞོན་ནུ་དང་། གནོད་སྦྱིན་གྱི་བུ་མོ་དང་། ཤ་ཟ་དང་། ཤ་ཟ་རྒན་པོ་དང་། ཤ་ཟ་གཞོན་ནུ་དང་། ཤ་ཟ་གཞོན་ནུ་མ་ཇི་སྙེད་པ་རྣམས་དང་། འགྲོ་བ་རྣམས་ལྷ་མ་ཡིན་དང་།
en: and departed for that grove of śāla trees in the country of the Mallas.
